apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpi2c_slave.c
/****************************************************************************
 * arch/arm/src/s32k1xx/s32k1xx_lpi2c_slave.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/clock.h>
#include <nuttx/i2c/i2c_slave.h>

#include <arch/irq.h>

#include "arm_internal.h"
#include "s32k1xx_pin.h"
#include "hardware/s32k1xx_pinmux.h"
#include "s32k1xx_lpi2c.h"
#include "s32k1xx_lpi2c_slave.h"
#include "s32k1xx_periphclocks.h"

#include <arch/board/board.h>

/* At least one I2C peripheral must be enabled, as well as the I2C slave */

#if defined(CONFIG_S32K1XX_LPI2C) && defined(CONFIG_I2C_SLAVE)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_ARCH_CHIP_S32K11X
#warning LPI2C slave logic does not support S32K11X (yet)
#endif

#ifdef CONFIG_I2C_POLLED
#warning LPI2C slave logic does not support polling (yet)
#endif

#ifdef CONFIG_I2C_TRACE
#warning LPI2C slave logic does not support I2C trace debugging (yet)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* I2C slave device hardware configuration */

struct s32k1xx_lpi2c_slave_config_s
{
  uint32_t base;      /* LPI2C base address */
  bool     slave_bus; /* Separate I2C slave bus? */
  uint32_t scl_pin;   /* GPIO configuration for SCL as SCL */
  uint32_t sda_pin;   /* GPIO configuration for SDA as SDA */
  uint32_t irq;       /* Event IRQ */
};

/* I2C slave device private data */

struct s32k1xx_lpi2c_slave_priv_s
{
  const struct i2c_slaveops_s *ops;                  /* I2C slave operations */
  const struct s32k1xx_lpi2c_slave_config_s *config; /* LPI2C slave configuration */

  int slave_addr; /* I2C address of the slave */
  int addr_nbits; /* 7- or 10-bit addressing */

  uint8_t *read_buffer; /* Read buffer (master wants to write, slave will read data) */
  int read_buflen;      /* Read buffer size */
  int read_bufindex;    /* Read buffer index */

  const uint8_t *write_buffer; /* Write buffer (master wants to read, slave will write data) */
  int write_buflen;            /* Write buffer size */
  int write_bufindex;          /* Write buffer index */

  i2c_slave_callback_t *callback; /* Callback function when data has been received */
  void *callback_arg;             /* Argument of callback function */

  int refs; /* Reference count */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline uint32_t s32k1xx_lpi2c_slave_getreg(
  struct s32k1xx_lpi2c_slave_priv_s *priv, uint16_t offset);
static inline void s32k1xx_lpi2c_slave_putreg(
  struct s32k1xx_lpi2c_slave_priv_s *priv, uint16_t offset,
  uint32_t value);
static inline void s32k1xx_lpi2c_slave_modifyreg(
  struct s32k1xx_lpi2c_slave_priv_s *priv, uint16_t offset,
  uint32_t clearbits, uint32_t setbits);

static int s32k1xx_lpi2c_slave_isr_process(
  struct s32k1xx_lpi2c_slave_priv_s *priv);
static int s32k1xx_lpi2c_slave_isr(int irq, void *context, void *arg);

static int s32k1xx_lpi2c_slave_init(
  struct s32k1xx_lpi2c_slave_priv_s *priv);
static int s32k1xx_lpi2c_slave_deinit(
  struct s32k1xx_lpi2c_slave_priv_s *priv);

static int s32k1xx_lpi2c_setownaddress(struct i2c_slave_s *dev, int addr,
                                       int nbits);
static int s32k1xx_lpi2c_write(struct i2c_slave_s *dev,
                               const uint8_t *buffer, int buflen);
static int s32k1xx_lpi2c_read(struct i2c_slave_s *dev,
                              uint8_t *buffer, int buflen);
static int s32k1xx_lpi2c_registercallback(struct i2c_slave_s *dev,
                                          i2c_slave_callback_t *callback,
                                          void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I2C slave interface */

static const struct i2c_slaveops_s s32k1xx_lpi2c_slaveops =
{
  .setownaddress    = s32k1xx_lpi2c_setownaddress,
  .write            = s32k1xx_lpi2c_write,
  .read             = s32k1xx_lpi2c_read,
  .registercallback = s32k1xx_lpi2c_registercallback,
};

/* I2C device structures */

#ifdef CONFIG_S32K1XX_LPI2C0
static const struct s32k1xx_lpi2c_slave_config_s s32k1xx_lpi2c0s_config =
{
  .base      = S32K1XX_LPI2C0_BASE,

#ifdef CONFIG_LPI2C0_SLAVE_BUS
  .slave_bus = true,
  .scl_pin   = PIN_LPI2C0_SCLS,
  .sda_pin   = PIN_LPI2C0_SDAS,
#else
  .slave_bus = false,
  .scl_pin   = PIN_LPI2C0_SCL,
  .sda_pin   = PIN_LPI2C0_SDA,
#endif

  .irq       = S32K1XX_IRQ_LPI2C0S,
};

static struct s32k1xx_lpi2c_slave_priv_s s32k1xx_lpi2c0s_priv =
{
  .ops            = &s32k1xx_lpi2c_slaveops,
  .config         = &s32k1xx_lpi2c0s_config,
  .slave_addr     = CONFIG_LPI2C0_SLAVE_ADDRESS,
  .addr_nbits     = 7,
  .read_buffer    = NULL,
  .read_buflen    = 0,
  .read_bufindex  = 0,
  .write_buffer   = NULL,
  .write_buflen   = 0,
  .write_bufindex = 0,
  .callback       = NULL,
  .callback_arg   = NULL,
  .refs           = 0,
};
#endif /* CONFIG_S32K1XX_LPI2C0 */

#ifdef CONFIG_S32K1XX_LPI2C1
static const struct s32k1xx_lpi2c_slave_config_s s32k1xx_lpi2c1s_config =
{
  .base      = S32K1XX_LPI2C1_BASE,

#ifdef CONFIG_LPI2C1_SLAVE_BUS
  .slave_bus = true,
  .scl_pin   = PIN_LPI2C1S_SCL,
  .sda_pin   = PIN_LPI2C1S_SDA,
#else
  .slave_bus = false,
  .scl_pin   = PIN_LPI2C1_SCL,
  .sda_pin   = PIN_LPI2C1_SDA,
#endif

