apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpi2c_slave.c
  .irq       = S32K1XX_IRQ_LPI2C1S,
};

static struct s32k1xx_lpi2c_slave_priv_s s32k1xx_lpi2c1s_priv =
{
  .ops            = &s32k1xx_lpi2c_slaveops,
  .config         = &s32k1xx_lpi2c1s_config,
  .slave_addr     = CONFIG_LPI2C1_SLAVE_ADDRESS,
  .addr_nbits     = 7,
  .read_buffer    = NULL,
  .read_buflen    = 0,
  .read_bufindex  = 0,
  .write_buffer   = NULL,
  .write_buflen   = 0,
  .write_bufindex = 0,
  .callback       = NULL,
  .callback_arg   = NULL,
  .refs           = 0,
};
#endif /* CONFIG_S32K1XX_LPI2C1 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k1xx_lpi2c_slave_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 * Input Parameters:
 *   priv   - I2C slave device private data
 *   offset - Register offset with respect to the base address of the I2C
 *            peripheral
 *
 * Returned Value:
 *   The 32-bit value retrieved from the register
 *
 ****************************************************************************/

static inline uint32_t s32k1xx_lpi2c_slave_getreg(
  struct s32k1xx_lpi2c_slave_priv_s *priv, uint16_t offset)
{
  return getreg32(priv->config->base + offset);
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_slave_putreg
 *
 * Description:
 *  Put a 32-bit register value by offset
 *
 * Input Parameters:
 *   priv   - I2C slave device private data
 *   offset - Register offset with respect to the base address of the I2C
 *            peripheral
 *   value  - The 32-bit value that should be put into the register
 *
 ****************************************************************************/

static inline void s32k1xx_lpi2c_slave_putreg(
  struct s32k1xx_lpi2c_slave_priv_s *priv, uint16_t offset,
  uint32_t value)
{
  putreg32(value, priv->config->base + offset);
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_slave_modifyreg
 *
 * Description:
 *   Modify a 32-bit register value by offset
 *
 * Input Parameters:
 *   priv      - I2C slave device private data
 *   offset    - Register offset with respect to the base address of the I2C
 *               peripheral
 *   clearbits - Bitmask with the bits that should be cleared (put to 0)
 *   setbits   - Bitmask with the bits that should be set (put to 1)
 *
 ****************************************************************************/

static inline void s32k1xx_lpi2c_slave_modifyreg(
  struct s32k1xx_lpi2c_slave_priv_s *priv, uint16_t offset,
  uint32_t clearbits, uint32_t setbits)
{
  modifyreg32(priv->config->base + offset, clearbits, setbits);
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_slave_isr_process
 *
 * Description:
 *   Process LPI2C slave interrupts.  Check for relevant flags and read or
 *   write data to buffers.  After a block of data has been received a
 *   callback function (if any) may be invoked, which might install a new
 *   write buffer to transmit data when requested.
 *
 * Input Parameters:
 *   priv - I2C slave device private data
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int s32k1xx_lpi2c_slave_isr_process(
  struct s32k1xx_lpi2c_slave_priv_s *priv)
{
  uint32_t status = s32k1xx_lpi2c_slave_getreg(priv,
                                               S32K1XX_LPI2C_SSR_OFFSET);

  /* Slave Address Valid Flag */

  if (status & LPI2C_SSR_AVF)
    {
      /* A new transfer was initiated by a bus master.  The transfer request
       * was addressed to this particular device.  It needs to be checked if
       * the master wants to read or write.
       */

      uint16_t address = (uint16_t) (s32k1xx_lpi2c_slave_getreg(priv,
        S32K1XX_LPI2C_SASR_OFFSET) & LPI2C_SASR_RADDR_MASK);

      if (address & I2CS_READBIT)
        {
          /* Master wants to read, so the slave needs to write/transmit.
           * The Transmit Data Interrupt will only be enabled now, see
           * erratum 10792.  Also reset the buffer index back to zero to
           * start sending again from the beginning.
           */

          s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_SIER_OFFSET, 0,
                                        LPI2C_SIER_TDIE);

          priv->write_bufindex = 0;
        }
      else
        {
          /* Master wants to write, so the slave needs to read.  The Receive
           * Data Interrupt remains enabled, so just reset the buffer index.
           */

          priv->read_bufindex = 0;
        }
    }

  /* Slave Transmits Data Flag (master wants to read) */

  if (status & LPI2C_SSR_TDF)
    {
      /* Make sure that interrupts are enabled for this event */

      if (s32k1xx_lpi2c_slave_getreg(priv,
        S32K1XX_LPI2C_SIER_OFFSET) & LPI2C_SIER_TDIE)
        {
          if (priv->write_buflen > priv->write_bufindex)
            {
              /* Transmit data from buffer */

              s32k1xx_lpi2c_slave_putreg(priv, S32K1XX_LPI2C_STDR_OFFSET,
                (uint32_t) priv->write_buffer[priv->write_bufindex]);
              priv->write_bufindex++;
            }
          else
            {
              /* Beyond the buffer length.  Transmit dummy data... */

              s32k1xx_lpi2c_slave_putreg(priv, S32K1XX_LPI2C_STDR_OFFSET, 0);
            }
        }
    }

  /* Slave Receives Data (master wants to write) */

  if (status & LPI2C_SSR_RDF)
    {
      /* Make sure that interrupts are enabled for this event */

      if (s32k1xx_lpi2c_slave_getreg(priv,
        S32K1XX_LPI2C_SIER_OFFSET) & LPI2C_SIER_RDIE)
        {
          if (priv->read_buflen > priv->read_bufindex)
            {
              /* Read data into buffer */

              priv->read_buffer[priv->read_bufindex] =
                (uint8_t) s32k1xx_lpi2c_slave_getreg(priv,
                  S32K1XX_LPI2C_SRDR_OFFSET);
              priv->read_bufindex++;
            }
          else
            {
              /* Dummy read, throw away the data */

              s32k1xx_lpi2c_slave_getreg(priv, S32K1XX_LPI2C_SRDR_OFFSET);
            }
        }
    }

  /* Stop or Repeated Start (current transfer is over) */

  if (s32k1xx_lpi2c_slave_getreg(priv, S32K1XX_LPI2C_SSR_OFFSET) & \
      (LPI2C_SSR_SDF | LPI2C_SSR_RSF))
    {
      /* Clear Stop Detect / Repeated Start Flags */

      s32k1xx_lpi2c_slave_putreg(priv, S32K1XX_LPI2C_SSR_OFFSET,
                                 LPI2C_SSR_SDF | LPI2C_SSR_RSF);

      /* Disable the Transmit Data Interrupt again, see erratum 10792 */

