apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpi2c_slave.c
      s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_SIER_OFFSET,
                                    LPI2C_SIER_TDIE, 0);

      /* Execute the registered callback function if data was received */

      if ((priv->read_bufindex > 0) && (priv->callback != NULL))
        {
          priv->callback(priv->callback_arg, I2CS_RX_COMPLETE,
                         priv->read_bufindex);
          priv->read_bufindex = 0;
        }

      /* Execute the registered callback function if data was send */

      if ((priv->write_bufindex > 0) && (priv->callback != NULL))
        {
          priv->callback(priv->callback_arg, I2CS_TX_COMPLETE,
                         priv->write_bufindex);
          priv->write_bufindex = 0;
        }
    }

  /* Slave Bit Error (abort current transfer) */

  if (s32k1xx_lpi2c_slave_getreg(priv, S32K1XX_LPI2C_SSR_OFFSET) & \
      LPI2C_SSR_BEF)
    {
      /* Clear Bit Error Flag */

      s32k1xx_lpi2c_slave_putreg(priv, S32K1XX_LPI2C_SSR_OFFSET,
                                 LPI2C_SSR_BEF);

      /* Disable the Transmit Data Interrupt again, see erratum 10792 */

      s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_SIER_OFFSET,
                                    LPI2C_SIER_TDIE, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_slave_isr
 *
 * Description:
 *   Interrupt Service Routine for LPI2C slave devices.  Retrieves the
 *   private data from the argument, further processing is done by
 *   s32k1xx_lpi2c_slave_isr_process().
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *   arg     - I2C slave device private data
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int s32k1xx_lpi2c_slave_isr(int irq, void *context, void *arg)
{
  struct s32k1xx_lpi2c_slave_priv_s *priv =
    (struct s32k1xx_lpi2c_slave_priv_s *)arg;

  DEBUGASSERT(priv != NULL);

  return s32k1xx_lpi2c_slave_isr_process(priv);
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_slave_init
 *
 * Description:
 *   Initialize the LPI2C slave device.  Enable and configure the peripheral
 *   and enable the interrupts and attach handlers.
 *
 * Input Parameters:
 *   priv - I2C slave device private data
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int s32k1xx_lpi2c_slave_init(
  struct s32k1xx_lpi2c_slave_priv_s *priv)
{
  int ret;

  /* Reset LPI2C slave mode logic before configuring it */

  s32k1xx_lpi2c_slave_putreg(priv, S32K1XX_LPI2C_SCR_OFFSET, LPI2C_SCR_RST);
  s32k1xx_lpi2c_slave_putreg(priv, S32K1XX_LPI2C_SCR_OFFSET, 0);

  /* Configure pins and power up peripheral.
   *
   * NOTE: Clocking to the LPI2C peripheral must be provided by
   * board-specific logic as part of the clock configuration logic.
   */

  ret = s32k1xx_pinconfig(priv->config->scl_pin);
  if (ret != OK)
    {
      return ret;
    }

  ret = s32k1xx_pinconfig(priv->config->sda_pin);
  if (ret != OK)
    {
      return ret;
    }

  /* Choose between a combined or separated LPI2C master and slave.  When a
   * separate slave bus is selected, the LPI2C slave will use different pins
   * than the LPI2C master.  These pins should be defined in board.h
   */

  if (priv->config->slave_bus)
    {
      s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_MCFGR1_OFFSET,
        LPI2C_MCFGR1_PINCFG_MASK, LPI2C_MCFGR1_PINCFG4);
    }
  else
    {
      s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_MCFGR1_OFFSET,
        LPI2C_MCFGR1_PINCFG_MASK, LPI2C_MCFGR1_PINCFG0);
    }

  /* Configure slave address
   *
   * TO DO: Allow 10-bit addressing
   */

  s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_SAMR_OFFSET, 0,
                                LPI2C_SAMR_ADDR0(priv->slave_addr));

  /* Enable clock stretching */

  s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_SCFGR1_OFFSET, 0,
    LPI2C_SCFGR1_ADRSTALL | LPI2C_SCFGR1_RXSTALL | LPI2C_SCFGR1_TXSTALL);

  /* Configure LPI2C slave interrupts */

  s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_SIER_OFFSET, 0,
    LPI2C_SIER_RDIE | LPI2C_SIER_AVIE | LPI2C_SIER_RSIE | LPI2C_SIER_SDIE | \
    LPI2C_SIER_BEIE);

  /* Attach ISR and enable interrupt */

  ret = irq_attach(priv->config->irq, s32k1xx_lpi2c_slave_isr, priv);
  if (ret != OK)
    {
      return ret;
    }

  up_enable_irq(priv->config->irq);

  /* Enable I2C slave */

  s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_SCR_OFFSET, 0,
                                LPI2C_SCR_SEN);

  return OK;
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_slave_deinit
 *
 * Description:
 *   Deinitialize the LPI2C slave device.  Disable and reset the peripheral
 *   and disable the interrupts and attached handlers.
 *
 * Input Parameters:
 *   priv - I2C slave device private data
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int s32k1xx_lpi2c_slave_deinit(
  struct s32k1xx_lpi2c_slave_priv_s *priv)
{
  int ret;

  /* Disable LPI2C slave */

  s32k1xx_lpi2c_slave_modifyreg(priv, S32K1XX_LPI2C_SCR_OFFSET,
                                LPI2C_SCR_SEN, 0);

  /* Reset LPI2C slave */

  s32k1xx_lpi2c_slave_putreg(priv, S32K1XX_LPI2C_SCR_OFFSET, LPI2C_SCR_RST);
  s32k1xx_lpi2c_slave_putreg(priv, S32K1XX_LPI2C_SCR_OFFSET, 0);

  /* Disable and detach interrupts */

  up_disable_irq(priv->config->irq);
  ret = irq_detach(priv->config->irq);
  if (ret != OK)
    {
      return ret;
    }

  /* NOTE that clocking is left enabled */

  return OK;
}

/****************************************************************************
 * Device Driver Operations
 ****************************************************************************/

/****************************************************************************
 * Name: s32k1xx_lpi2c_setownaddress
 *
 * Description:
 *   Set our own I2C address.
 *
 *   One may register a callback to be notified about reception. During the
 *   slave mode reception, the methods READ and WRITE must be used to
 *   to handle reads and writes from a master.
 *
 * Input Parameters:
 *   dev     - I2C slave device-specific state data
 *   address - Our own slave address
 *   nbits   - The number of address bits provided (7 or 10)
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

