apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpi2c_slave.c
static int s32k1xx_lpi2c_setownaddress(struct i2c_slave_s *dev, int addr,
                                       int nbits)
{
  struct s32k1xx_lpi2c_slave_priv_s *priv;
  irqstate_t flags;

  DEBUGASSERT(dev);
  priv = (struct s32k1xx_lpi2c_slave_priv_s *)dev;

  flags = enter_critical_section();

  /* Deinit slave before we change its configuration */

  int ret = s32k1xx_lpi2c_slave_deinit(priv);
  if (ret != OK)
    {
      leave_critical_section(flags);
      return ret;
    }

  /* Modify configuration */

  switch (nbits)
    {
      case 7:
        {
          priv->slave_addr = (addr & 0x7f);
          priv->addr_nbits = 7;
        }
        break;

      case 10:
        {
          priv->slave_addr = (addr & 0x03ff);
          priv->addr_nbits = 10;
        }
        break;

      default:
        {
          leave_critical_section(flags);
          return ERROR;
        }
        break;
    }

  /* Reinitialize slave with the changed config */

  s32k1xx_lpi2c_slave_init(priv);

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_write
 *
 * Description:
 *   Send a block of data on I2C when a bus master wants to read data from
 *   this particular device.
 *
 * Input Parameters:
 *   dev    - I2C slave device-specific state data
 *   buffer - A pointer to the read-only buffer of data to be written to the
 *            device
 *   buflen - The number of bytes to send from the buffer
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int s32k1xx_lpi2c_write(struct i2c_slave_s *dev,
                               const uint8_t *buffer, int buflen)
{
  struct s32k1xx_lpi2c_slave_priv_s *priv;
  irqstate_t flags;

  DEBUGASSERT(dev);
  priv = (struct s32k1xx_lpi2c_slave_priv_s *)dev;

  flags = enter_critical_section();

  /* Update the registered buffer and length */

  priv->write_buffer = buffer;
  priv->write_buflen = buflen;

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_read
 *
 * Description:
 *   Receive a block of data from I2C when a bus master writes data addressed
 *   to this particular device.
 *
 * Input Parameters:
 *   dev    - I2C slave device-specific state data
 *   buffer - A pointer to a buffer of data to receive the data from the
 *            device
 *   buflen - The maximum size of the buffer
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int s32k1xx_lpi2c_read(struct i2c_slave_s *dev,
                              uint8_t *buffer, int buflen)
{
  struct s32k1xx_lpi2c_slave_priv_s *priv;
  irqstate_t flags;

  DEBUGASSERT(dev);
  priv = (struct s32k1xx_lpi2c_slave_priv_s *)dev;

  flags = enter_critical_section();

  /* Update the registered buffer and length */

  priv->read_buffer = buffer;
  priv->read_buflen = buflen;

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: s32k1xx_lpi2c_registercallback
 *
 * Description:
 *   Register a callback function that will be invoked when something is
 *   received on I2C.
 *
 * Input Parameters:
 *   dev      - I2C slave device-specific state data
 *   callback - The function to be called when something has been received.
 *   arg      - User provided argument to be used with the callback
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int s32k1xx_lpi2c_registercallback(struct i2c_slave_s *dev,
                                          i2c_slave_callback_t *callback,
                                          void *arg)
{
  struct s32k1xx_lpi2c_slave_priv_s *priv;
  irqstate_t flags;

  DEBUGASSERT(dev);
  priv = (struct s32k1xx_lpi2c_slave_priv_s *)dev;

  flags = enter_critical_section();

  /* Update the registered callback and argument */

  priv->callback = callback;
  priv->callback_arg = arg;

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k1xx_i2cbus_slave_initialize
 *
 * Description:
 *   Initialize the I2C slave device and increase the reference counter.
 *   If the device has already been initialized only the reference counter
 *   will be increased.
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple I2C interfaces).
 *
 * Returned Value:
 *   A valid I2C device structure reference on success; a NULL on failure.
 *
 ****************************************************************************/

struct i2c_slave_s *s32k1xx_i2cbus_slave_initialize(int port)
{
  struct s32k1xx_lpi2c_slave_priv_s *priv;
  irqstate_t flags;

  /* Get I2C private structure */

  switch (port)
    {
#ifdef CONFIG_S32K1XX_LPI2C0
      case 0:
        priv = (struct s32k1xx_lpi2c_slave_priv_s *)&s32k1xx_lpi2c0s_priv;
        break;
#endif

#ifdef CONFIG_S32K1XX_LPI2C1
      case 1:
        priv = (struct s32k1xx_lpi2c_slave_priv_s *)&s32k1xx_lpi2c1s_priv;
        break;
#endif

      default:
        return NULL;
    }

  flags = enter_critical_section();

  if (priv->refs == 0)
    {
      /* Initialize private data for the first time, increment reference
       * count, power-up hardware and configure pins.
       */

      s32k1xx_lpi2c_slave_init(priv);
    }

  priv->refs++;

  leave_critical_section(flags);

  return (struct i2c_slave_s *)priv;
}

/****************************************************************************
 * Name: s32k1xx_i2cbus_slave_uninitialize
 *
 * Description:
 *   Decrease the reference counter of the I2C slave device.  When there are
 *   no more references left the I2C slave device is uninitialized.
 *
 * Input Parameters:
 *   dev - Device structure as returned by s32k1xx_i2cbus_slave_initialize().
 *
 * Returned Value:
 *   OK on success, ERROR when there is an internal reference count mismatch
 *   or dev points to an invalid hardware device.
 *
 ****************************************************************************/

int s32k1xx_i2cbus_slave_uninitialize(struct i2c_slave_s *dev)
{
  struct s32k1xx_lpi2c_slave_priv_s *priv =
    (struct s32k1xx_lpi2c_slave_priv_s *)dev;
  irqstate_t flags;

  DEBUGASSERT(dev);

  /* Check reference count for underflow, then decrement */

  flags = enter_critical_section();

  if (priv->refs == 0)
    {
      leave_critical_section(flags);
      return ERROR;
    }

  priv->refs--;

  if (priv->refs > 0)
    {
      leave_critical_section(flags);
      return OK;
    }

  leave_critical_section(flags);

  /* Disable power and other HW resources (pins) */

  s32k1xx_lpi2c_slave_deinit(priv);

  return OK;
}

#endif /* CONFIG_S32K1XX_LPI2C && CONFIG_I2C_SLAVE */
